Initial Data science

In [15]:
!ls

Exploration_analysis.ipynb   imdb.title.principals.csv.gz
bom.movie_gross.csv          imdb.title.ratings.csv.gz
bom.movie_gross.csv.gz       rt.movie_info.tsv.gz
imdb.name.basics.csv.gz      rt.reviews.tsv.gz
imdb.title.akas.csv.gz       tmdb.movies.csv.gz
imdb.title.basics.csv.gz     tn.movie_budgets.csv.gz
imdb.title.crew.csv.gz

Using the movie budgets is part of data exploration to use for how much to expect in terms of cost for the average 
movie productions.

In [30]:
import pandas as pd
movie_budgets_df = pd.read_csv('tn.movie_budgets.csv.gz')
# movie_reviews_df = pd.read_csv('rt.reviews.tsv.gz')
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [18]:
movie_budgets_df.tail()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [3]:
movie_budgets_df.isnull().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

Some movies, has a net revenue of $0. Irrespective of how much money is used in the production budgets it did not produce any revenue at all.

In [36]:
movie_budgets_df[movie_budgets_df['worldwide_gross'] == '$0']

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
194,95,"Dec 31, 2020",Moonfall,"$150,000,000",$0,$0
479,80,"Dec 13, 2017",Bright,"$90,000,000",$0,$0
480,81,"Dec 31, 2019",Army of the Dead,"$90,000,000",$0,$0
535,36,"Feb 21, 2020",Call of the Wild,"$82,000,000",$0,$0
670,71,"Aug 30, 2019",PLAYMOBIL,"$75,000,000",$0,$0
...,...,...,...,...,...,...
5761,62,"Dec 31, 2014",Stories of Our Lives,"$15,000",$0,$0
5764,65,"Dec 31, 2007",Tin Can Man,"$12,000",$0,$0
5771,72,"May 19, 2015",Family Motocross,"$10,000",$0,$0
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0

Sorting the movies based on how well they did either by how much they made or how expensive it became

In [38]:
movie_budgets_df.sort_values('production_budget', ascending=False).head(10)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
406,7,"Nov 6, 2015",The Peanuts Movie,"$99,000,000","$130,178,411","$250,091,610"
407,8,"Feb 8, 2019",The LEGO Movie 2: The Second Part,"$99,000,000","$105,806,508","$190,325,698"
408,9,"Nov 21, 2018",Robin Hood,"$99,000,000","$30,824,628","$84,747,441"
5326,27,"Jun 1, 2007",And Then Came Love,"$989,000","$8,158","$8,158"
409,10,"May 4, 2001",The Mummy Returns,"$98,000,000","$202,007,640","$435,040,395"
410,11,"Dec 20, 2002",Gangs of New York,"$97,000,000","$77,730,500","$183,124,621"
411,12,"May 19, 2017",Alien: Covenant,"$97,000,000","$74,262,031","$238,521,247"
5332,33,"Mar 3, 2015",Ask Me Anything,"$950,000",$0,$0
5331,32,"Aug 12, 2014",Jesse,"$950,000",$0,$0
5327,28,"Apr 14, 2006",Hard Candy,"$950,000","$1,024,640","$8,267,066"

In [39]:
movie_budgets_df.sort_values('domestic_gross', ascending=False).head(10)

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
311,12,"Jul 4, 2008",AstÃ©rix aux Jeux Olympiques,"$113,500,000","$999,811","$132,999,811"
1605,6,"Feb 11, 2011",Gnomeo and Juliet,"$36,000,000","$99,967,670","$193,737,977"
642,43,"Aug 3, 2018",Christopher Robin,"$75,000,000","$99,215,042","$197,504,758"
4373,74,"Jun 4, 1999",Desert Blue,"$5,000,000","$99,147","$99,147"
707,8,"Jun 13, 1997",Hercules,"$70,000,000","$99,112,101","$250,700,000"
5442,43,"Jul 30, 1999",Twin Falls Idaho,"$500,000","$985,341","$1,027,228"
708,9,"Mar 22, 2013",Olympus Has Fallen,"$70,000,000","$98,927,592","$172,878,928"
3003,4,"Jun 28, 1978",Heaven Can Wait,"$15,000,000","$98,800,000","$98,800,000"
328,29,"Jan 14, 2011",The Green Hornet,"$110,000,000","$98,780,042","$229,155,503"
998,99,"Apr 9, 2010",Date Night,"$55,000,000","$98,711,404","$152,269,033"

In [25]:
# movie_budgets_df['production_budget'] = movie_budgets_df['production_budget'].replace('$','', regex=True, inplace=True)

    The columns for production budget, domestic gross and the worldwide gross of each movies are in string format. It needs to be converted to integers

In [ ]:
movie_budgets_df['production_budget'] = movie_budgets_df['production_budget'].str.replace(',', '')

In [48]:
movie_budgets_df['production_budget'] = movie_budgets_df['production_budget'].str.replace('$', '')
movie_budgets_df['production_budget'] = movie_budgets_df['production_budget'].astype(int)

In [53]:
movie_budgets_df['domestic_gross'] = movie_budgets_df['domestic_gross'].str.replace(',', '').str.replace('$', '')
movie_budgets_df['domestic_gross'] = movie_budgets_df['domestic_gross'].astype(int)

In [54]:
movie_budgets_df['worldwide_gross'] = movie_budgets_df['worldwide_gross'].str.replace(',', '').str.replace('$', '')
movie_budgets_df['worldwide_gross'] = movie_budgets_df['worldwide_gross'].astype(int)

The next column is for the rate of return for each movie

In [57]:
movie_budgets_df['total_gross'] = movie_budgets_df['domestic_gross'] + movie_budgets_df['worldwide_gross']

In [60]:
movie_budgets_df['returns_in_%'] = (movie_budgets_df['total_gross'] / movie_budgets_df['production_budget']) * 100

In [61]:
movie_budgets_df.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,total_gross,returns_in_%
0,1,"Dec 18, 2009",Avatar,425000000,760507625,2776345279,3536852904,832.200683
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1045663875,1286727750,313.377435
2,3,"Jun 7, 2019",Dark Phoenix,350000000,42762350,149762350,192524700,55.007057
3,4,"May 1, 2015",Avengers: Age of Ultron,330600000,459005868,1403013963,1862019831,563.224389
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1316721747,1936903129,611.010451

In [62]:
movie_budgets_df.isnull().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
total_gross          0
returns_in_%         0
dtype: int64